letters = 'abcdefg'
print(letters)
print(letters[::-1]) #Элементы строки в обратном порядке
print(letters[::2]) #Каждый второй элемент строки (включая самый первый)
print(letters[1::2]) #Каждый второй элемент строки после первого
print(letters[:1]) #Все элементы до второго
print(letters[-1:-2:-1]) #Все элементы, начиная с конца до предпоследнего
print(letters[3:4]) #Все элементы в диапазоне индексов от 3 до 4 (не включая 4)
print(letters[-3:]) #Последние три элемента строки
print(letters[3:5]) #Все элементы в диапазоне индексов от 3 до 4 (не включая 5)
print(letters[4:2:-1]) #То же, что и в предыдущем пункте, но в обратном порядке
